# 2 Pandas

In [1]:
import pandas as pd

In [3]:
df = pd.DataFrame({
    "Name" : ["Suraphop","Linda","John"],
    "Age" : [30,25,35],
    "Sex" : ["M","F","M"]
})
print(df)
print(type(df))

       Name  Age Sex
0  Suraphop   30   M
1     Linda   25   F
2      John   35   M
<class 'pandas.core.frame.DataFrame'>

In [10]:
datas = [["Mark",55,"Italy",4.5,"Europe"],
         ["john",33,"USA",6.9,"America"],
         ["tim",41,"USA",3.9,"America"]]
columns = ["name","age","country","score","continent"]

df = pd.DataFrame(data=datas,columns=columns)
print('dataframe')
df

dataframe

   name  age country  score continent
0  Mark   55   Italy    4.5    Europe
1  john   33     USA    6.9   America
2   tim   41     USA    3.9   America

## 2.2 Input

### 1.2.1 csv and excel

In [14]:
df = pd.read_csv(r"C:\Users\nmb_m\OneDrive\Desktop\python_office_2025-08-27\data\production_data.csv")
print(type(df))
df

<class 'pandas.core.frame.DataFrame'>

     production_date    ng_topic  amount
0           1/1/2019        blur       1
1           1/1/2019  incomplete       1
2           1/1/2019  incomplete       1
3           1/1/2019        blur       1
4           1/1/2019  incomplete       1
...              ...         ...     ...
9488       1/31/2019  short mold       1
9489       1/31/2019   no solder       1
9490       1/31/2019  incomplete       1
9491       1/31/2019   no solder       1
9492       1/31/2019        burn       1

[9493 rows x 3 columns]

In [15]:
df = pd.read_csv(r"data\production_data.csv")
print(type(df))
df

<class 'pandas.core.frame.DataFrame'>

     production_date    ng_topic  amount
0           1/1/2019        blur       1
1           1/1/2019  incomplete       1
2           1/1/2019  incomplete       1
3           1/1/2019        blur       1
4           1/1/2019  incomplete       1
...              ...         ...     ...
9488       1/31/2019  short mold       1
9489       1/31/2019   no solder       1
9490       1/31/2019  incomplete       1
9491       1/31/2019   no solder       1
9492       1/31/2019        burn       1

[9493 rows x 3 columns]

In [18]:
#!pip install openpyxl

In [20]:
df = pd.read_excel(r"C:\Users\nmb_m\OneDrive\Desktop\python_office_2025-08-27\data\ng_data_january.xlsx")
df

     production_date    ng_topic  amount
0         2024-01-01        blur       1
1         2024-01-01  incomplete       1
2         2024-01-01  incomplete       1
3         2024-01-01        blur       1
4         2024-01-01  incomplete       1
...              ...         ...     ...
9488      2024-01-31  short mold       1
9489      2024-01-31   no solder       1
9490      2024-01-31  incomplete       1
9491      2024-01-31   no solder       1
9492      2024-01-31        burn       1

[9493 rows x 3 columns]

#### 1.2.2 local floder

In [ ]:
import os

path = r"C:\Users\nmb_m\OneDrive\Desktop\python_office_2025-08-27\data\sales_data"
xlsx_file_lists = []

for root,dirs,files in os.walk(path): 
   #print('Root:',root)
   # print('Dirs:',dirs) 
   #print('Files:',files)
   
   for name in files:
       if name.endswith(".xlsx"):
         file_path = os.path.join(root,name)
         #print(file_path)
         xlsx_file_lists.append(file_path)
#df = pd.read_excel(r"C:\Users\nmb_m\OneDrive\Desktop\python_office_2025-08-27\data\ng_data_january.xlsx")
xlsx_file_lists

['C:\\Users\\nmb_m\\OneDrive\\Desktop\\python_office_2025-08-27\\data\\sales_data\\2024\\April.xlsx',
 'C:\\Users\\nmb_m\\OneDrive\\Desktop\\python_office_2025-08-27\\data\\sales_data\\2024\\August.xlsx',
 'C:\\Users\\nmb_m\\OneDrive\\Desktop\\python_office_2025-08-27\\data\\sales_data\\2024\\December.xlsx',
 'C:\\Users\\nmb_m\\OneDrive\\Desktop\\python_office_2025-08-27\\data\\sales_data\\2024\\February.xlsx',
 'C:\\Users\\nmb_m\\OneDrive\\Desktop\\python_office_2025-08-27\\data\\sales_data\\2024\\January.xlsx',
 'C:\\Users\\nmb_m\\OneDrive\\Desktop\\python_office_2025-08-27\\data\\sales_data\\2024\\July.xlsx',
 'C:\\Users\\nmb_m\\OneDrive\\Desktop\\python_office_2025-08-27\\data\\sales_data\\2024\\June.xlsx',
 'C:\\Users\\nmb_m\\OneDrive\\Desktop\\python_office_2025-08-27\\data\\sales_data\\2024\\March.xlsx',
 'C:\\Users\\nmb_m\\OneDrive\\Desktop\\python_office_2025-08-27\\data\\sales_data\\2024\\May.xlsx',
 'C:\\Users\\nmb_m\\OneDrive\\Desktop\\python_office_2025-08-27\\data\\sales_data\\2024\\November.xlsx',
 'C:\\Users\\nmb_m\\OneDrive\\Desktop\\python_office_2025-08-27\\data\\sales_data\\2024\\October.xlsx',
 'C:\\Users\\nmb_m\\OneDrive\\Desktop\\python_office_2025-08-27\\data\\sales_data\\2024\\September.xlsx']

In [37]:
df_lists = [] 

for file in xlsx_file_lists:
    df = pd.read_excel(file)
    df_lists.append(df)
df_lists

[     transaction_id          store  status transaction_date    plan  \
 0          7fb801a5        Chicago  ACTIVE       2024-04-01  Silver
 1          8e8bdb2a  San Francisco  ACTIVE       2024-04-01  Silver
 2          239db9b6  Washington DC  ACTIVE       2024-04-01  Silver
 3          7ccb13ab  San Francisco  ACTIVE       2024-04-01    Gold
 4          c18e82d9        Chicago  ACTIVE       2024-04-01  Bronze
 ...             ...            ...     ...              ...     ...
 7428       b3fcd96c         Boston  ACTIVE       2024-04-30  Bronze
 7429       eec9e52a  San Francisco  ACTIVE       2024-04-30  Silver
 7430       a9c90deb       New York  ACTIVE       2024-04-30  Bronze
 7431       d585c5c1       New York  ACTIVE       2024-04-30  Silver
 7432       f30b34e7  San Francisco  ACTIVE       2024-04-30  Silver

      contract_type  amount
 0              NEW   14.25
 1              NEW   14.25
 2              NEW   14.25
 3              NEW   19.35
 4              NEW   12.20
 ...            ...     ...
 7428           NEW   12.20
 7429           NEW   14.25
 7430           NEW   12.20
 7431           NEW   14.25
 7432           NEW   14.25

 [7433 rows x 7 columns],
      transaction_id          store  status transaction_date    plan  \
 0          8d2b0582        Chicago  ACTIVE       2024-08-01  Silver
 1          61e3773d        Chicago  ACTIVE       2024-08-01    Gold
 2          52b3f422       New York  ACTIVE       2024-08-01  Bronze
 3          ae0498f2        Chicago  ACTIVE       2024-08-01  Silver
 4          7d1f5d57       New York  ACTIVE       2024-08-01  Silver
 ...             ...            ...     ...              ...     ...
 8417       47f7aca1  San Francisco  ACTIVE       2024-08-30  Silver
 8418       2bdcceba         Boston  ACTIVE       2024-08-30  Silver
 8419       e0aa3c08        Chicago  ACTIVE       2024-08-30  Silver
 8420       aff115c2  San Francisco  ACTIVE       2024-08-30  Silver
 8421       0bed8c3d       New York  ACTIVE       2024-08-30  Silver

      contract_type  amount
 0              NEW   14.25
 1              NEW   19.35
 2              NEW   12.20
 3              NEW   14.25
 4              NEW   14.25
 ...            ...     ...
 8417           NEW   14.25
 8418           NEW   14.25
 8419           NEW   14.25
 8420           NEW   14.25
 8421           NEW   14.25

 [8422 rows x 7 columns],
      transaction_id          store  status transaction_date    plan  \
 0          0c84fc60       New York  ACTIVE       2024-12-02  Silver
 1          f369c701  San Francisco  ACTIVE       2024-12-02  Bronze
 2          1c2558bf        Chicago  ACTIVE       2024-12-02  Silver
 3          3f98abc7  San Francisco  ACTIVE       2024-12-02  Silver
 4          1ca71cb6       New York  ACTIVE       2024-12-02  Silver
 ...             ...            ...     ...              ...     ...
 7359       07da9a05       New York  ACTIVE       2024-12-31  Silver
 7360       a776b812  San Francisco  ACTIVE       2024-12-31  Silver
 7361       16a9246f       New York  ACTIVE       2024-12-31  Silver
 7362       9ff448be       New York  ACTIVE       2024-12-31    Gold
 7363       edb00d25       New York  ACTIVE       2024-12-31  Bronze

      contract_type  amount
 0              NEW   14.25
 1              NEW   12.20
 2              NEW   14.25
 3              NEW   14.25
 4              NEW   14.25
 ...            ...     ...
 7359           NEW   14.25
 7360           NEW   14.25
 7361           NEW   14.25
 7362           NEW   19.35
 7363           NEW   12.20

 [7364 rows x 7 columns],
      transaction_id          store  status transaction_date    plan  \
 0          629b9f16       New York  ACTIVE       2024-02-01  Silver
 1          2f57ac6c      Las Vegas  ACTIVE       2024-02-01  Silver
 2          45e063e6      Las Vegas  ACTIVE       2024-02-01  Silver
 3          6ef3a43a       New York  ACTIVE       2024-02-01  Silver
 4          89f0cec1  San Francisco  ACTIVE       2024-02-01    Gold
 ...             ...            ...     ...              ...     ...
 8489       d0782c26        Chicago  ACTIVE       2024-02-28  Silver
 8490       95c7977e  San Francisco  ACTIVE       2024-02-28  Silver
 8491       919c37d1       New York  ACTIVE       2024-02-28  Silver
 8492       b1820c05       New York  ACTIVE       2024-02-28  Bronze
 8493       efe816e4      Las Vegas  ACTIVE       2024-02-28  Silver

      contract_type  amount
 0              NEW   14.25
 1              NEW   14.25
 2              NEW   14.25
 3              NEW   14.25
 4              NEW   19.35
 ...            ...     ...
 8489           NEW   14.25
 8490           NEW   14.25
 8491           NEW   14.25
 8492           NEW   12.20
 8493           NEW   14.25

 [8494 rows x 7 columns],
      transaction_id          store  status transaction_date    plan  \
 0          abfbdd6d        Chicago  ACTIVE       2024-01-01  Silver
 1          136a9997  San Francisco  ACTIVE       2024-01-01    Gold
 2          c6688f32  San Francisco  ACTIVE       2024-01-01  Bronze
 3          6ef349c1        Chicago  ACTIVE       2024-01-01    Gold
 4          22066f29  San Francisco  ACTIVE       2024-01-01  Silver
 ...             ...            ...     ...              ...     ...
 9488       b487a1a6       New York  ACTIVE       2024-01-31  Silver
 9489       9ab1fb48         Boston  ACTIVE       2024-01-31  Bronze
 9490       08766c08  San Francisco  ACTIVE       2024-01-31  Silver
 9491       3e56df84         Boston  ACTIVE       2024-01-31  Bronze
 9492       2f28e861  Washington DC  ACTIVE       2024-01-31  Bronze

      contract_type  amount
 0              NEW   14.25
 1              NEW   19.35
 2              NEW   12.20
 3              NEW   19.35
 4              NEW   14.25
 ...            ...     ...
 9488           NEW   14.25
 9489           NEW   12.20
 9490           NEW   14.25
 9491           NEW   12.20
 9492           NEW   12.20

 [9493 rows x 7 columns],
      transaction_id          store  status transaction_date    plan  \
 0          b82c1d77       New York  ACTIVE       2024-07-01  Silver
 1          05c2cb05       New York  ACTIVE       2024-07-01  Silver
 2          62e4c1ff       New York  ACTIVE       2024-07-01  Silver
 3          536437fb       New York  ACTIVE       2024-07-01    Gold
 4          5c126e56  San Francisco  ACTIVE       2024-07-01  Silver
 ...             ...            ...     ...              ...     ...
 7159       f05ebfda         Boston  ACTIVE       2024-07-31  Silver
 7160       dd1e218b  San Francisco  ACTIVE       2024-07-31  Silver
 7161       6ecfabf4        Chicago  ACTIVE       2024-07-31  Silver
 7162       063a64a3       New York  ACTIVE       2024-07-31    Gold
 7163       bd059d1a  San Francisco  ACTIVE       2024-07-31  Silver

      contract_type  amount
 0              NEW   14.25
 1              NEW   14.25
 2              NEW   14.25
 3              NEW   19.35
 4              NEW   14.25
 ...            ...     ...
 7159           NEW   14.25
 7160           NEW   14.25
 7161           NEW   14.25
 7162           NEW   19.35
 7163           NEW   14.25

 [7164 rows x 7 columns],
      transaction_id          store  status transaction_date    plan  \
 0          85b9aadf         Boston  ACTIVE       2024-06-03    Gold
 1          dbc4b91a  San Francisco  ACTIVE       2024-06-03  Silver
 2          1c425787       New York  ACTIVE       2024-06-03  Silver
 3          7ba76b0f  San Francisco  ACTIVE       2024-06-03    Gold
 4          f52e41d9       New York  ACTIVE       2024-06-03  Silver
 ...             ...            ...     ...              ...     ...
 8569       9418df9f        Chicago  ACTIVE       2024-06-28  Silver
 8570       c9ee14da      Las Vegas  ACTIVE       2024-06-28  Silver
 8571       54026b4a       New York  ACTIVE       2024-06-28  Silver
 8572       438b3952       New York  ACTIVE       2024-06-28    Gold
 8573       ac093715       New York  ACTIVE       2024-06-28  Bronze

      contract_type  amount
 0              NEW   19.35
 1              NEW   14.25
 2              NEW   14.25
 3              NEW   19.35
 4              NEW   14.25
 ...            ...     ...
 8569           NEW   14.25
 8570           NEW   14.25
 8571           NEW   14.25
 8572           NEW   19.35
 8573           NEW   12.20

 [8574 rows x 7 columns],
      transaction_id          store  status transaction_date    plan  \
 0          7e189393        Chicago  ACTIVE       2024-03-01  Silver
 1          ed416609  Washington DC  ACTIVE       2024-03-01  Silver
 2          c575e712       New York  ACTIVE       2024-03-01  Bronze
 3          e47af516  San Francisco  ACTIVE       2024-03-01  Silver
 4          a19ba534       New York  ACTIVE       2024-03-01    Gold
 ...             ...            ...     ...              ...     ...
 7559       02050375      Las Vegas  ACTIVE       2024-03-29  Silver
 7560       18353e1e  San Francisco  ACTIVE       2024-03-29  Bronze
 7561       8d1f10ff  San Francisco  ACTIVE       2024-03-29  Silver
 7562       d773cecc  San Francisco  ACTIVE       2024-03-29  Silver
 7563       b17d5751        Chicago  ACTIVE       2024-03-29  Silver

      contract_type  amount
 0              NEW   14.25
 1              NEW   14.25
 2              NEW   12.20
 3              NEW   14.25
 4              NEW   19.35
 ...            ...     ...
 7559           NEW   14.25
 7560           NEW   12.20
 7561           NEW   14.25
 7562           NEW   14.25
 7563           NEW   14.25

 [7564 rows x 7 columns],
      transaction_id          store  status transaction_date    plan  \
 0          449d4aa9       New York  ACTIVE       2024-05-01  Bronze
 1          6b38f1e5  San Francisco  ACTIVE       2024-05-01  Bronze
 2          18ec3257  San Francisco  ACTIVE       2024-05-01  Bronze
 3          4eeb8941  Washington DC  ACTIVE       2024-05-01  Silver
 4          5e00fae5         Boston  ACTIVE       2024-05-01  Bronze
 ...             ...            ...     ...              ...     ...
 7227       3c2155e1        Chicago  ACTIVE       2024-05-31  Silver
 7228       7ec4f241  Washington DC  ACTIVE       2024-05-31  Silver
 7229       2da9bdbd        Chicago  ACTIVE       2024-05-31  Silver
 7230       3a153211  Washington DC  ACTIVE       2024-05-31    Gold
 7231       3e0f1423  San Francisco  ACTIVE       2024-05-31  Silver

      contract_type  amount
 0              NEW   12.20
 1              NEW   12.20
 2              NEW   12.20
 3              NEW   14.25
 4              NEW   12.20
 ...            ...     ...
 7227           NEW   14.25
 7228           NEW   14.25
 7229           NEW   14.25
 7230           NEW   19.35
 7231           NEW   14.25

 [7232 rows x 7 columns],
      transaction_id          store  status transaction_date    plan  \
 0          ceb84a6b       New York  ACTIVE       2024-11-01    Gold
 1          940c49b6        Chicago  ACTIVE       2024-11-01  Silver
 2          07b541d6       New York  ACTIVE       2024-11-01  Bronze
 3          61d52a79       New York  ACTIVE       2024-11-01    Gold
 4          3228dd2f        Chicago  ACTIVE       2024-11-01    Gold
 ...             ...            ...     ...              ...     ...
 8767       1bc005bd      Las Vegas  ACTIVE       2024-11-29  Bronze
 8768       cedfdf42  San Francisco  ACTIVE       2024-11-29  Silver
 8769       668109e8       New York  ACTIVE       2024-11-29  Bronze
 8770       5135f21a       New York  ACTIVE       2024-11-29  Bronze
 8771       df2efc44        Chicago  ACTIVE       2024-11-29  Silver

      contract_type  amount
 0              NEW   19.35
 1              NEW   14.25
 2              NEW   12.20
 3              NEW   19.35
 4              NEW   19.35
 ...            ...     ...
 8767           NEW   12.20
 8768           NEW   14.25
 8769           NEW   12.20
 8770           NEW   12.20
 8771           NEW   14.25

 [8772 rows x 7 columns],
      transaction_id          store  status transaction_date    plan  \
 0          a5196775  San Francisco  ACTIVE       2024-10-01  Silver
 1          24f5b1bd       New York  ACTIVE       2024-10-01  Silver
 2          7d3a57e3  San Francisco  ACTIVE       2024-10-01  Silver
 3          1b8c6651         Boston  ACTIVE       2024-10-01  Bronze
 4          0e42361a         Boston  ACTIVE       2024-10-01  Silver
 ...             ...            ...     ...              ...     ...
 5714       0240388f  San Francisco  ACTIVE       2024-10-31  Silver
 5715       5dd35b12  San Francisco  ACTIVE       2024-10-31    Gold
 5716       54777a09        Chicago  ACTIVE       2024-10-31  Silver
 5717       d3fba6d1       New York  ACTIVE       2024-10-31  Silver
 5718       68defd25        Chicago  ACTIVE       2024-10-31    Gold

      contract_type  amount
 0              NEW   14.25
 1              NEW   14.25
 2              NEW   14.25
 3              NEW   12.20
 4              NEW   14.25
 ...            ...     ...
 5714           NEW   14.25
 5715           NEW   19.35
 5716           NEW   14.25
 5717           NEW   14.25
 5718           NEW   19.35

 [5719 rows x 7 columns],
      transaction_id          store  status transaction_date    plan  \
 0          1625da17       New York  ACTIVE       2024-09-02  Silver
 1          a60801a8         Boston  ACTIVE       2024-09-02  Silver
 2          478f5985       New York  ACTIVE       2024-09-02  Silver
 3          ca84fd4c      Las Vegas  ACTIVE       2024-09-02  Silver
 4          69fa39a9         Boston  ACTIVE       2024-09-02  Bronze
 ...             ...            ...     ...              ...     ...
 7347       53a449b0       New York  ACTIVE       2024-09-30  Silver
 7348       35b46c26         Boston  ACTIVE       2024-09-30  Silver
 7349       9e498c85        Chicago  ACTIVE       2024-09-30  Silver
 7350       5841d16e  San Francisco  ACTIVE       2024-09-30  Silver
 7351       86937799        Chicago  ACTIVE       2004-12-30    Gold

      contract_type  amount
 0              NEW   14.25
 1              NEW   14.25
 2              NEW   14.25
 3              NEW   14.25
 4              NEW   12.20
 ...            ...     ...
 7347           NEW   14.25
 7348           NEW   14.25
 7349           NEW   14.25
 7350           NEW   14.25
 7351           NEW   19.35

 [7352 rows x 7 columns]]

In [41]:
df_lists[0]

,transaction_id,store,status,transaction_date,plan,contract_type,amount
0,7fb801a5,Chicago,ACTIVE,2024-04-01,Silver,NEW,14.25
1,8e8bdb2a,San Francisco,ACTIVE,2024-04-01,Silver,NEW,14.25
2,239db9b6,Washington DC,ACTIVE,2024-04-01,Silver,NEW,14.25
3,7ccb13ab,San Francisco,ACTIVE,2024-04-01,Gold,NEW,19.35
4,c18e82d9,Chicago,ACTIVE,2024-04-01,Bronze,NEW,12.20
...,...,...,...,...,...,...,...
7428,b3fcd96c,Boston,ACTIVE,2024-04-30,Bronze,NEW,12.20
7429,eec9e52a,San Francisco,ACTIVE,2024-04-30,Silver,NEW,14.25
7430,a9c90deb,New York,ACTIVE,2024-04-30,Bronze,NEW,12.20
7431,d585c5c1,New York,ACTIVE,2024-04-30,Silver,NEW,14.25
7432,f30b34e7,San Francisco,ACTIVE,2024-04-30,Silver,NEW,14.25

In [42]:
len(df_lists)

12

In [44]:
df_lists[11]

,transaction_id,store,status,transaction_date,plan,contract_type,amount
0,1625da17,New York,ACTIVE,2024-09-02,Silver,NEW,14.25
1,a60801a8,Boston,ACTIVE,2024-09-02,Silver,NEW,14.25
2,478f5985,New York,ACTIVE,2024-09-02,Silver,NEW,14.25
3,ca84fd4c,Las Vegas,ACTIVE,2024-09-02,Silver,NEW,14.25
4,69fa39a9,Boston,ACTIVE,2024-09-02,Bronze,NEW,12.20
...,...,...,...,...,...,...,...
7347,53a449b0,New York,ACTIVE,2024-09-30,Silver,NEW,14.25
7348,35b46c26,Boston,ACTIVE,2024-09-30,Silver,NEW,14.25
7349,9e498c85,Chicago,ACTIVE,2024-09-30,Silver,NEW,14.25
7350,5841d16e,San Francisco,ACTIVE,2024-09-30,Silver,NEW,14.25
7351,86937799,Chicago,ACTIVE,2004-12-30,Gold,NEW,19.35

#### 2.2.3 api

In [ ]:
#!pip install requests
import requests
url = "https://covid19.ddc.moph.go.th/api/Cases/today-cases-by-provinces"

res = requests.get(url,headers={"User-Agent" : "Mozilla/5.0"})
data = res.json()
#print(data)

df = pd.DataFrame.from_dict(data)
df

,year,weeknum,province,new_case,total_case,new_case_excludeabroad,total_case_excludeabroad,new_death,total_death,update_date
0,2024,34,บุรีรัมย์,6,578,6,578,0,0,2024-12-23 12:16:13
1,2024,34,สุรินทร์,16,702,16,702,0,11,2024-12-23 12:16:13
2,2024,34,หนองคาย,6,410,6,410,0,0,2024-12-23 12:16:13
3,2024,34,พิจิตร,4,245,4,245,0,1,2024-12-23 12:16:13
4,2024,34,อุทัยธานี,3,155,3,155,0,1,2024-12-23 12:16:13
...,...,...,...,...,...,...,...,...,...,...
74,2024,34,ตาก,0,341,0,341,0,1,2024-12-23 12:16:13
75,2024,34,มหาสารคาม,0,40,0,40,0,0,2024-12-23 12:16:13
76,2024,34,ลำพูน,0,122,0,122,0,1,2024-12-23 12:16:13
77,2024,34,น่าน,0,216,0,216,0,2,2024-12-23 12:16:13
78,2024,34,ตรัง,1,357,1,357,0,0,2024-12-23 12:16:13

### 2.2.4 Database

In [56]:
#!pip install pypyodbc
import pypyodbc

cnxn = pypyodbc.connect("Driver= {SQL Server};"
                        "Server=192.168.1.103;"
                        "Database=test;"
                        "uid=sa;"
                        "pwd=sa$admin")

df = pd.read_sql_query("SELECT * FROM [test].[dbo].[Table_1]",cnxn)
df

C:\Users\nmb_m\AppData\Local\Temp\ipykernel_10988\1908990825.py:10: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query("SELECT * FROM [test].[dbo].[Table_1]",cnxn)

         test
0  12
1  123
2  12
3  2
4  12
5  1
6  1
7  2
8  3
9  4

## 2.3 Index

In [57]:
datas = [["Mark",55,"Italy",4.5,"Europe"],
         ["john",33,"USA",6.9,"America"],
         ["tim",41,"USA",3.9,"America"]]
columns = ["name","age","country","score","continent"]

df = pd.DataFrame(data=datas,columns=columns)
df

   name  age country  score continent
0  Mark   55   Italy    4.5    Europe
1  john   33     USA    6.9   America
2   tim   41     USA    3.9   America

In [58]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [59]:
df.index.name = "user_id"
df

         name  age country  score continent
user_id
0        Mark   55   Italy    4.5    Europe
1        john   33     USA    6.9   America
2         tim   41     USA    3.9   America

In [61]:
df.reset_index()

   user_id  name  age country  score continent
0        0  Mark   55   Italy    4.5    Europe
1        1  john   33     USA    6.9   America
2        2   tim   41     USA    3.9   America

In [62]:
df.set_index("name")

      age country  score continent
name
Mark   55   Italy    4.5    Europe
john   33     USA    6.9   America
tim    41     USA    3.9   America

## 2.4 Sort

In [63]:
datas = [["Mark",55,"Italy",4.5,"Europe"],
         ["john",33,"USA",6.9,"America"],
         ["tim",41,"USA",3.9,"America"]]
columns = ["name","age","country","score","continent"]

df = pd.DataFrame(data=datas,columns=columns)
df

   name  age country  score continent
0  Mark   55   Italy    4.5    Europe
1  john   33     USA    6.9   America
2   tim   41     USA    3.9   America

In [64]:
df.sort_index()

   name  age country  score continent
0  Mark   55   Italy    4.5    Europe
1  john   33     USA    6.9   America
2   tim   41     USA    3.9   America

In [65]:
df.sort_index(ascending=False)

   name  age country  score continent
2   tim   41     USA    3.9   America
1  john   33     USA    6.9   America
0  Mark   55   Italy    4.5    Europe

In [66]:
df.sort_values(["continent"],ascending=False)

   name  age country  score continent
0  Mark   55   Italy    4.5    Europe
1  john   33     USA    6.9   America
2   tim   41     USA    3.9   America

In [67]:
df.sort_values(["continent","age"],ascending=False)

   name  age country  score continent
0  Mark   55   Italy    4.5    Europe
2   tim   41     USA    3.9   America
1  john   33     USA    6.9   America

## 2.5 Columns

In [68]:
datas = [["Mark",55,"Italy",4.5,"Europe"],
         ["john",33,"USA",6.9,"America"],
         ["tim",41,"USA",3.9,"America"]]
columns = ["name","age","country","score","continent"]

df = pd.DataFrame(data=datas,columns=columns)
df

   name  age country  score continent
0  Mark   55   Italy    4.5    Europe
1  john   33     USA    6.9   America
2   tim   41     USA    3.9   America

In [69]:
df.columns

Index(['name', 'age', 'country', 'score', 'continent'], dtype='object')

In [72]:
df.rename(columns={"name" : "first name" , "age" : "AGE"},inplace=True)

df

  first name  AGE country  score continent
0       Mark   55   Italy    4.5    Europe
1       john   33     USA    6.9   America
2        tim   41     USA    3.9   America

### 1.5.2 Drop

In [73]:
datas = [["Mark",55,"Italy",4.5,"Europe"],
         ["john",33,"USA",6.9,"America"],
         ["tim",41,"USA",3.9,"America"]]
columns = ["name","age","country","score","continent"]

df = pd.DataFrame(data=datas,columns=columns)
df

   name  age country  score continent
0  Mark   55   Italy    4.5    Europe
1  john   33     USA    6.9   America
2   tim   41     USA    3.9   America

In [74]:
df.drop(columns=["score","continent"],inplace=True)
df

   name  age country
0  Mark   55   Italy
1  john   33     USA
2   tim   41     USA

### 1.5.3 Transpose

In [75]:
datas = [["Mark",55,"Italy",4.5,"Europe"],
         ["john",33,"USA",6.9,"America"],
         ["tim",41,"USA",3.9,"America"]]
columns = ["name","age","country","score","continent"]

df = pd.DataFrame(data=datas,columns=columns)
df

   name  age country  score continent
0  Mark   55   Italy    4.5    Europe
1  john   33     USA    6.9   America
2   tim   41     USA    3.9   America

In [76]:
df.T

                0        1        2
name         Mark     john      tim
age            55       33       41
country     Italy      USA      USA
score         4.5      6.9      3.9
continent  Europe  America  America

## 4.6 Data Manipulation

### 4.6.1 selecting

In [77]:
datas = [["Mark",55,"Italy",4.5,"Europe"],
         ["john",33,"USA",6.9,"America"],
         ["tim",41,"USA",3.9,"America"]]
columns = ["name","age","country","score","continent"]

df = pd.DataFrame(data=datas,columns=columns)
df

   name  age country  score continent
0  Mark   55   Italy    4.5    Europe
1  john   33     USA    6.9   America
2   tim   41     USA    3.9   America

In [79]:
df.loc[0,"name"]

'Mark'

In [83]:
# 55 
df.loc[0,"age"]
# 55,33
df.loc[:1,"age"]
# name , country
df.loc[0:2,["name","country"]]
df.loc[:,["name","country"]]

   name country
0  Mark   Italy
1  john     USA
2   tim     USA

In [84]:
df.iloc[0,0]

'Mark'

In [85]:
df[df["age"] > 40]

   name  age country  score continent
0  Mark   55   Italy    4.5    Europe
2   tim   41     USA    3.9   America

In [ ]:
df[ (df["age"] > 40) & (df["country"] == "USA")] #and

  name  age country  score continent
2  tim   41     USA    3.9   America

In [87]:
df[ (df["age"] > 40) | (df["country"] == "USA")] # or

   name  age country  score continent
0  Mark   55   Italy    4.5    Europe
1  john   33     USA    6.9   America
2   tim   41     USA    3.9   America

example1 : 
- score >4 and continent is Europe or America

example2 : 
- age >40 and continent is Europe or America